In [7]:
import pandas as pd
from ingest_data import Extract_data
from

In [8]:
url_lake = '../Data_Lake/data.csv'
url_house = '../Data_Warehouse/data_cleaned.csv'

In [10]:
df = Extract_data('data')

Your data is loaded succesfully in Data Lake

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    6 non-null      object
 1   rank    6 non-null      object
 2   name    6 non-null      object
 3   score1  6 non-null      object
 4   score2  6 non-null      object
dtypes: object(5)
memory usage: 368.0+ bytes

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    6 non-null      object
 1   rank    6 non-null      object
 2   name    6 non-null      object
 3   score1  6 non-null      object
 4   score2  6 non-null      object
dtypes: object(5)
memory usage: 368.0+ bytes

In [5]:
df2

  rank name  score1  score2
0  1st    A      44      67
1  2nd    B      55      63
2  1st    D      88      98

In [9]:
df.columns

Index(['ID ', 'name ', 'category ', 'main_category ', 'currency ', 'deadline ',
       'goal ', 'launched ', 'pledged ', 'state ', 'backers ', 'country ',
       'usd pledged ', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15',
       'Unnamed: 16'],
      dtype='object')

In [10]:
df.head(4)

,ID,name,category,main_category,currency,deadline,goal,launched,pledged,state,backers,country,usd pledged,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,1000002330,The Songs of Adelaide & Abullah,Poetry,Publishing,GBP,2015-10-09 11:36:00,1000,2015-08-11 12:12:28,0,failed,0,GB,0,NaN,NaN,NaN,NaN
1,1000004038,Where is Hank?,Narrative Film,Film & Video,USD,2013-02-26 00:20:50,45000,2013-01-12 00:20:50,220,failed,3,US,220,NaN,NaN,NaN,NaN
2,1000007540,ToshiCapital Rekordz Needs Help to Complete Album,Music,Music,USD,2012-04-16 04:24:11,5000,2012-03-17 03:24:11,1,failed,1,US,1,NaN,NaN,NaN,NaN
3,1000011046,Community Film Project: The Art of Neighborhoo...,Film & Video,Film & Video,USD,2015-08-29 01:00:00,19500,2015-07-04 08:35:03,1283,canceled,14,US,1283,NaN,NaN,NaN,NaN